Revit 2024 API
BuiltInFailures.DimensionFailures.WrongConstraintInTrussSketch Property
 Structural Truss sketch can't be constrained to its members.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WrongConstraintInTrussSketch { get; }
Visual Basic
Public Shared ReadOnly Property WrongConstraintInTrussSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WrongConstraintInTrussSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace